CREATE TABLE `_vedom` (
  `id` int(11) NOT NULL,
  `m` varchar(75) DEFAULT NULL,
  `n` varchar(355) DEFAULT NULL,
  `object_id` int(11) DEFAULT NULL,
  `munobr_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

delete from _vedom;

insert into _vedom(id, m, n) values(1,'город-курорт Анапа','Андреева Гора - ст-ца Варениковская - г.Анапа');
insert into _vedom(id, m, n) values(2,'город-курорт Анапа','х.Красный-х.Воскресенский');
insert into _vedom(id, m, n) values(3,'город-курорт Анапа','г.Анапа - с.Сукко');
insert into _vedom(id, m, n) values(4,'город-курорт Анапа','г.Анапа - с.Сукко');
insert into _vedom(id, m, n) values(5,'город-курорт Анапа','г.Анапа - с.Сукко');
insert into _vedom(id, m, n) values(6,'город-курорт Анапа','г.Крымск - с.Джигинка');
insert into _vedom(id, m, n) values(7,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(8,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(9,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(10,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(11,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(12,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(13,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(14,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(15,'Апшеронский район','г.Белореченск-г.Апшеронск');
insert into _vedom(id, m, n) values(16,'Апшеронский район','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(17,'Апшеронский район','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(18,'Апшеронский район','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(19,'Апшеронский район','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(20,'Апшеронский район','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(21,'Апшеронский район','г.Майкоп-г.Туапсе');
insert into _vedom(id, m, n) values(22,'Апшеронский район','г.Апшеронск-ст-ца Нефтяная');
insert into _vedom(id, m, n) values(23,'Апшеронский район','г.Апшеронск-ст-ца Нефтяная');
insert into _vedom(id, m, n) values(24,'Апшеронский район','г.Майкоп-г.Туапсе');
insert into _vedom(id, m, n) values(25,'Белореченский район','ст-ца Гурийская-ст-ца Черниговская-ст-ца Рязанская');
insert into _vedom(id, m, n) values(26,'Белореченский район','п.Мирный-ст-ца Бжедуховская-х.Беляевский');
insert into _vedom(id, m, n) values(27,'Белореченский район','г.Белореченск-п.Родники');
insert into _vedom(id, m, n) values(28,'Брюховецкий район','Подъезд к х.Бейсугское');
insert into _vedom(id, m, n) values(29,'Брюховецкий район','х.Гарбузовая Балка-х.Рогачи');
insert into _vedom(id, m, n) values(30,'Выселковский район','ст-ца Журавская-г.Тихорецк');
insert into _vedom(id, m, n) values(31,'Выселковский район','Подъезд к ст.Балковская');
insert into _vedom(id, m, n) values(32,'Выселковский район','ст-ца Выселки-ст-ца Новомалороссийская');
insert into _vedom(id, m, n) values(33,'Выселковский район','х.Бейсужек Второй-ст-ца Новобейсугская');
insert into _vedom(id, m, n) values(34,'Выселковский район','х.Бейсужек Второй-ст-ца Новобейсугская');
insert into _vedom(id, m, n) values(35,'Выселковский район','х.Бейсужек Второй-ст-ца Новобейсугская');
insert into _vedom(id, m, n) values(36,'Брюховецкий район','ст-ца Новоджерелиевская-ст-ца Брюховецкая-ст-ца Батуринская');
insert into _vedom(id, m, n) values(37,'город Горячий Ключ','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(38,'город Горячий Ключ','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(39,'город Горячий Ключ','ст-ца Кубанская-ст-ца Саратовская');
insert into _vedom(id, m, n) values(40,'город-курорт Геленджик','Подъезд к с.Марьина Роща');
insert into _vedom(id, m, n) values(41,'город-курорт Геленджик','Магистраль "Дон"-с.Адербиевка');
insert into _vedom(id, m, n) values(42,'город-курорт Геленджик','Магистраль "Дон"-х.Бетта');
insert into _vedom(id, m, n) values(43,'Динской район','ст-ца Калининская-ст-ца Новотитаровкая');
insert into _vedom(id, m, n) values(44,'Динской район','ст-ца Калининская-ст-ца Новотитаровкая');
insert into _vedom(id, m, n) values(45,'Динской район','ст-ца Калининская-ст-ца Новотитаровкая');
insert into _vedom(id, m, n) values(46,'Динской район','ст-ца Калининская-ст-ца Новотитаровкая');
insert into _vedom(id, m, n) values(47,'Динской район','г.Краснодар-г.Кропоткин-граница Ставропольского края');
insert into _vedom(id, m, n) values(48,'Динской район','г.Краснодар-г.Кропоткин-граница Ставропольского края');
insert into _vedom(id, m, n) values(49,'Динской район','ст-ца Динская-ст-ца Васюринская');
insert into _vedom(id, m, n) values(50,'Динской район','ст-ца Динская-ст-ца Васюринская');
insert into _vedom(id, m, n) values(51,'Динской район','ст-ца Динская-ст-ца Васюринская');
insert into _vedom(id, m, n) values(52,'Динской район','ст-ца Динская-ст-ца Васюринская');
insert into _vedom(id, m, n) values(53,'Динской район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(54,'Динской район','ст-ца Нововеличковская-с.Долиновское');
insert into _vedom(id, m, n) values(55,'Динской район','ст-ца Динская-п.Агроном');
insert into _vedom(id, m, n) values(56,'Ейский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(57,'Ейский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(58,'Ейский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(59,'Ейский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(60,'Ейский район','г.Ейск-ст-ца Ясенская-ст-ца Копанская-ст-ца Новоминская');
insert into _vedom(id, m, n) values(61,'Ейский район','г.Ейск-ст-ца Ясенская-ст-ца Копанская-ст-ца Новоминская');
insert into _vedom(id, m, n) values(62,'Кавказский район','г.Краснодар - г.Кропоткин - граница Ставропольского края');
insert into _vedom(id, m, n) values(63,'Кавказский район','г.Кропоткин-ст-ца Темижбекская');
insert into _vedom(id, m, n) values(64,'Кавказский район','ст.Тбилисская-г.Кропоткин');
insert into _vedom(id, m, n) values(65,'Кавказский район','ст.Тбилисская-г.Кропоткин');
insert into _vedom(id, m, n) values(66,'Кавказский район','Подъезд к с.Казанская');
insert into _vedom(id, m, n) values(67,'Калининский район','ст.Калининская-ст.Новотитаровская');
insert into _vedom(id, m, n) values(68,'Каневской район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(69,'Кореновский район','п.Комсомольский-х.Анапский');
insert into _vedom(id, m, n) values(70,'Красноармейский район','п.Полтавский-п.Красный Лес');
insert into _vedom(id, m, n) values(71,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(72,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(73,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(74,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(75,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(76,'город Краснодар','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(77,'город Краснодар','г.Краснодар - г.Кропоткин - граница Ставропольского края');
insert into _vedom(id, m, n) values(78,'город Краснодар','п.Колосистый-х.Копанской-ст-ца Новотитаровская');
insert into _vedom(id, m, n) values(79,'город Краснодар','п.Колосистый-х.Копанской-ст-ца Новотитаровская');
insert into _vedom(id, m, n) values(80,'город Краснодар','ст-ца Динская-п.Агроном');
insert into _vedom(id, m, n) values(81,'город Краснодар','ст-ца Динская-п.Агроном');
insert into _vedom(id, m, n) values(82,'Крыловский район','ст-ца Крыловская-ст-ца Новопашковская-х.Тверской');
insert into _vedom(id, m, n) values(83,'Крыловский район','ст-ца Крыловская-ст-ца Новопашковская-х.Тверской');
insert into _vedom(id, m, n) values(84,'Крыловский район','ст-ца Крыловская-с.Шевченковское');
insert into _vedom(id, m, n) values(85,'Крыловский район','ст-ца Крыловская-с.Шевченковское');
insert into _vedom(id, m, n) values(86,'Крыловский район','ст-ца Крыловская-с.Шевченковское');
insert into _vedom(id, m, n) values(87,'Крыловский район','Магистраль "Дон"-ст-ца Крыловская');
insert into _vedom(id, m, n) values(88,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(89,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(90,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(91,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(92,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(93,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(94,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(95,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(96,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(97,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(98,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(99,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(100,'Крымский район','г.Крымск-с.Джигинка');
insert into _vedom(id, m, n) values(101,'Крымский район','с.Экономическое-ст-ца Нижебаканская');
insert into _vedom(id, m, n) values(102,'Крымский район','г.Крымск-х.Аккерменка');
insert into _vedom(id, m, n) values(103,'Крымский район','г.Крымск-х.Аккерменка');
insert into _vedom(id, m, n) values(104,'Крымский район','ст-ца Троицкая-ст-ца Федоровская');
insert into _vedom(id, m, n) values(105,'Крымский район','ст-ца Варениковская-х.Школьный');
insert into _vedom(id, m, n) values(106,'Крымский район','г.Крымск-с.Джигинка, км 16+114 справа');
insert into _vedom(id, m, n) values(107,'Крымский район','г.Славянск-на-Кубани-г.Крымск');
insert into _vedom(id, m, n) values(108,'Крымский район','г.Славянск-на-Кубани-г.Крымск');
insert into _vedom(id, m, n) values(109,'Курганинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(110,'Курганинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(111,'Курганинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(112,'Курганинский район','г.Армавир-г.Курганинск');
insert into _vedom(id, m, n) values(113,'Кущевский район','Подъезд к ст-це Кущевская');
insert into _vedom(id, m, n) values(114,'Кущевский район','Подъезд к ст-це Кущевская');
insert into _vedom(id, m, n) values(115,'Кущевский район','ст-ца Шкуринская-х.Красная Поляна');
insert into _vedom(id, m, n) values(116,'Кущевский район','ст-ца Шкуринская-х.Красная Поляна');
insert into _vedom(id, m, n) values(117,'Кущевский район','ст-ца Шкуринская-х.Красная Поляна');
insert into _vedom(id, m, n) values(118,'Лабинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(119,'Лабинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(120,'Лабинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(121,'Лабинский район','Северный подъезд к г.Лабинск');
insert into _vedom(id, m, n) values(122,'Лабинский район','г.Лабинск-пгт.Мостовской-граница КЧР');
insert into _vedom(id, m, n) values(123,'Лабинский район','г.Лабинск-нгт.Мостовской-граница КЧР');
insert into _vedom(id, m, n) values(124,'Лабинский район','г.Лабинск-пгт.Мостовской-граница КЧР');
insert into _vedom(id, m, n) values(125,'Лабинский район','г.Лабинск-нгт.Мостовской-граница КЧР');
insert into _vedom(id, m, n) values(126,'Лабинский район','г.Лабинск-пгт.Мостовской-граница КЧР');
insert into _vedom(id, m, n) values(127,'Лабинский район','г.Усть-Лабинск-Лабинск-Упорная');
insert into _vedom(id, m, n) values(128,'Ленинградский район','ст-ца Староминская-ст-ца Ленинградская-ст-ца Павловская');
insert into _vedom(id, m, n) values(129,'Ленинградский район','ст-ца Ленинградская-х.Белый-ст.Октябрьская');
insert into _vedom(id, m, n) values(130,'Новокубанский район','г.Армавир-ст-ца Отрадная');
insert into _vedom(id, m, n) values(131,'Новокубанский район','Подъезд к центральной усадьбе ОПХ "Ленинский Путь"');
insert into _vedom(id, m, n) values(132,'Новокубанский район','Подъезд к центральной усадьбе ОПХ "Ленинский Путь"');
insert into _vedom(id, m, n) values(133,'Новокубанский район','Подъезд к п.Глубокий');
insert into _vedom(id, m, n) values(134,'Новокубанский район','г.Армавир-ст-ца Николаевская');
insert into _vedom(id, m, n) values(135,'Новокубанский район','с.Отрадо-Ольгинское-г.Новокубанск-г.Армавир');
insert into _vedom(id, m, n) values(136,'Новокубанский район','с.Отрадо-Ольгинское-г.Новокубанск-г.Армавир');
insert into _vedom(id, m, n) values(137,'Новопокровский район','г.Тихорецк-с.Белая Глина-граница Рост.обл.');
insert into _vedom(id, m, n) values(138,'Новопокровский район','ст-ца Новопокровская-ст-ца Плоская');
insert into _vedom(id, m, n) values(139,'Новопокровский район','Подъезд к с.Горькая Балка');
insert into _vedom(id, m, n) values(140,'город Новороссийск','Подъезд к ж-д ст.Гайдук');
insert into _vedom(id, m, n) values(141,'город Новороссийск','Подъезд к ст.Раевская');
insert into _vedom(id, m, n) values(142,'Отрадненский район','г.Армавир-ст-ца Отрадная');
insert into _vedom(id, m, n) values(143,'Отрадненский район','г.Армавир-ст-ца Отрадная');
insert into _vedom(id, m, n) values(144,'Отрадненский район','ст-ца Отрадная-х.Трактовый');
insert into _vedom(id, m, n) values(145,'Отрадненский район','ст-ца Отрадная-х.Трактовый');
insert into _vedom(id, m, n) values(146,'Отрадненский район','ст-ца Отрадная-граница Ставропольского края');
insert into _vedom(id, m, n) values(147,'Павловский район','ст.Павловская-ст.Веселая-ст.Незамаевская');
insert into _vedom(id, m, n) values(148,'Павловский район','ст.Павловская-ст.Веселая-ст.Незамаевская');
insert into _vedom(id, m, n) values(149,'Павловский район','ст.Павловская-ст.Веселая-ст.Незамаевская');
insert into _vedom(id, m, n) values(150,'Павловский район','ст.Старолеушковская-х.Средний Челбас');
insert into _vedom(id, m, n) values(151,'Павловский район','ст.Старолеушковская-х.Средний Челбас');
insert into _vedom(id, m, n) values(152,'Павловский район','ст.Старолеушковская-ст-ца Украинская');
insert into _vedom(id, m, n) values(153,'Приморско-Ахтарский район','г.Тимашевск-г.Приморско-Ахтарск');
insert into _vedom(id, m, n) values(154,'Приморско-Ахтарский район','г.Тимашевск-г.Приморско-Ахтарск');
insert into _vedom(id, m, n) values(155,'Приморско-Ахтарский район','подъезд к п.Приморский');
insert into _vedom(id, m, n) values(156,'Северский район','пгт.Афипский-ст-ца Смоленская');
insert into _vedom(id, m, n) values(157,'Северский район','пгт.Афипский-ст-ца Смоленская');
insert into _vedom(id, m, n) values(158,'Северский район','подъезд к ст-це Северской');
insert into _vedom(id, m, n) values(159,'Северский район','подъезд к ст-це Убинской');
insert into _vedom(id, m, n) values(160,'Северский район','х.Стефановский-х.Новоивановский-ст-ца Дербентская');
insert into _vedom(id, m, n) values(161,'Северский район','х.Стефановский-х.Новоивановский-ст-ца Дербентская');
insert into _vedom(id, m, n) values(162,'Северский район','Подъезд к с.Шабановское');
insert into _vedom(id, m, n) values(163,'Славянский район','х.Бараниковский-х.Семисводный-ст-ца Анастасиевская');
insert into _vedom(id, m, n) values(164,'Славянский район','х.Бараниковский-х.Семисводный-ст-ца Анастасиевская');
insert into _vedom(id, m, n) values(165,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(166,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(167,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(168,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(169,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(170,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(171,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(172,'Славянский район','г.Славянск-на-Кубани-ст-ца Петровская-п.Целинный-с.Ачуево');
insert into _vedom(id, m, n) values(173,'Славянский район','г.Славянск-на-Кубани-г.Крымск');
insert into _vedom(id, m, n) values(174,'Славянский район','ст-ца Петровская-ст-ца Черноерковская-х.Слободка');
insert into _vedom(id, m, n) values(175,'Славянский район','ст-ца Петровская-п.Забойский');
insert into _vedom(id, m, n) values(176,'Славянский район','Обход ст-цы Анастасиевской');
insert into _vedom(id, m, n) values(177,'Славянский район','Обход ст-цы Анастасиевской');
insert into _vedom(id, m, n) values(178,'Сочи','Якорная Щель-с.Беранда');
insert into _vedom(id, m, n) values(179,'Сочи','п.Дагомыс-с.Барановка');
insert into _vedom(id, m, n) values(180,'Сочи','п.Дагомыс-с.Солохаул');
insert into _vedom(id, m, n) values(181,'Сочи','п.Дагомыс-с.Солохаул');
insert into _vedom(id, m, n) values(182,'Тбилисский район','ст-ца Тбилисская-г.Кропоткин');
insert into _vedom(id, m, n) values(183,'Тбилисский район','ст-ца Тбилисская-г.Кропоткин');
insert into _vedom(id, m, n) values(184,'Темрюкский район','г.Темрюк-ст-ца Фонталовская');
insert into _vedom(id, m, n) values(185,'Темрюкский район','г.Темрюк-ст-ца Фонталовская');
insert into _vedom(id, m, n) values(186,'Темрюкский район','Андреева Гора - ст-ца Варениковская - г.Анапа');
insert into _vedom(id, m, n) values(187,'Темрюкский район','п.Сенной-ст-ца Тамань');
insert into _vedom(id, m, n) values(188,'Темрюкский район','п.Стрелка-ст-ца Старотитаровская-п.Прогресс');
insert into _vedom(id, m, n) values(189,'Темрюкский район','п.Стрелка-ст-ца Старотитаровская-п.Прогресс');
insert into _vedom(id, m, n) values(190,'Тимашевский район','г.Тимашевск-ст-ца Полтавская');
insert into _vedom(id, m, n) values(191,'Тимашевский район','г.Тимашевск-ст-ца Полтавская');
insert into _vedom(id, m, n) values(192,'Тимашевский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(193,'Тимашевский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(194,'Тимашевский район','Подъезд к х.Ленинский');
insert into _vedom(id, m, n) values(195,'Тимашевский район','Подъезд к х.Беднягина');
insert into _vedom(id, m, n) values(196,'Тимашевский район','ст-ца Медвёдовская-х.Большевик');
insert into _vedom(id, m, n) values(197,'Тимашевский район','ст-ца Медвёдовская-х.Ленинский');
insert into _vedom(id, m, n) values(198,'Тимашевский район','ст-ца Новокорсунская-х.Незаймановский');
insert into _vedom(id, m, n) values(199,'Тихорецкий район','ст-ца Журавская-г.Тихорецк');
insert into _vedom(id, m, n) values(200,'Тихорецкий район','ст-ца Архангельская-ст-ца Нововладимирская');
insert into _vedom(id, m, n) values(201,'Тихорецкий район','г.Тихорецк-х.Ленинское Возрождения');
insert into _vedom(id, m, n) values(202,'Туапсинский район','г.Майкоп-г.Туапсе');
insert into _vedom(id, m, n) values(203,'Туапсинский район','г.Майкоп-г.Туапсе');
insert into _vedom(id, m, n) values(204,'Туапсинский район','Подъезд к а.Агуй-Шапсуг');
insert into _vedom(id, m, n) values(205,'Туапсинский район','Подъезд к а.Агуй-Шапсуг');
insert into _vedom(id, m, n) values(206,'Туапсинский район','Подъезд к с.Тенгинка');
insert into _vedom(id, m, n) values(207,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(208,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(209,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(210,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(211,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(212,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(213,'Успенский район','г.Армавир-с.Успенское-г.Невинномыск');
insert into _vedom(id, m, n) values(214,'Усть-Лабинский район',' г.Краснодар - г.Кропоткин - граница Ставропольского края');
insert into _vedom(id, m, n) values(215,'Усть-Лабинский район','ст-ца Воронежская - с.Суворовское - ст-ца Пластуновская');
insert into _vedom(id, m, n) values(216,'Усть-Лабинский район','ст-ца Воронежская-с.Суворовское-ст-ца Пластуновская');
insert into _vedom(id, m, n) values(217,'Усть-Лабинский район','ст-ца Воронежская - с.Суворовское - ст-ца Пластуновская');
insert into _vedom(id, m, n) values(218,'Усть-Лабинский район','ст-ца Воронежская - с.Суворовское - ст-ца Пластуновская');
insert into _vedom(id, m, n) values(219,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная');
insert into _vedom(id, m, n) values(220,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная');
insert into _vedom(id, m, n) values(221,'Усть-Лабинский район','Подъезд к х.Александровский');
insert into _vedom(id, m, n) values(222,'Усть-Лабинский район','ст-ца Некрасовская-х.Братский');
insert into _vedom(id, m, n) values(223,'Усть-Лабинский район','ст-ца Некрасовская-х.Братский');
insert into _vedom(id, m, n) values(224,'Усть-Лабинский район','ст-ца Некрасовская-х.Братский');
insert into _vedom(id, m, n) values(225,'Щербиновский район','г.Краснодар-г.Ейск');
insert into _vedom(id, m, n) values(226,'Абинский район','г. Абинск-Варнавинское водохранилище');
insert into _vedom(id, m, n) values(227,'Абинский район','Подъезд к ст-це Эриванская');
insert into _vedom(id, m, n) values(228,'город-курорт Анапа','подъезд к х.Малый Разнокол');
insert into _vedom(id, m, n) values(229,'город-курорт Анапа','Андреева Гора- ст-ца Варениковская - г. Анапа');
insert into _vedom(id, m, n) values(230,'город-курорт Анапа','Андреева Гора- ст-ца Варениковская - г. Анапа');
insert into _vedom(id, m, n) values(231,'город-курорт Анапа','Андреева Гора- ст-ца Варениковская - г. Анапа');
insert into _vedom(id, m, n) values(232,'Апшеронский район','г.Майкоп - г.Туапсе');
insert into _vedom(id, m, n) values(233,'Апшеронский район','ст-ца Кубанская - ст-ца Саратовская');
insert into _vedom(id, m, n) values(234,'Апшеронский район','г.Апшеронск - ст-ца Нефтяная');
insert into _vedom(id, m, n) values(235,'Апшеронский район','г.Майкоп - г.Туапсе');
insert into _vedom(id, m, n) values(236,'Апшеронский район','г.Майкоп - г.Туапсе');
insert into _vedom(id, m, n) values(237,'Апшеронский район','г.Майкоп - г.Туапсе');
insert into _vedom(id, m, n) values(238,'город Армавир','г.Армавир - ст-ца Николаевская');
insert into _vedom(id, m, n) values(239,'Белоглинский район','с.Белая Глина - ст-ца Ильинская');
insert into _vedom(id, m, n) values(240,'Белоглинский район','с.Белая Глина - ст-ца Ильинская');
insert into _vedom(id, m, n) values(241,'Белоглинский район','с.Белая Глина - ст-ца Ильинская ');
insert into _vedom(id, m, n) values(242,'Белоглинский район','с.Белая Глина - ст-ца Ильинская ');
insert into _vedom(id, m, n) values(243,'Белоглинский район','с.Белая Глина - ст-ца Ильинская ');
insert into _vedom(id, m, n) values(244,'Белореченский район','ст-ца Гурийская - ст-ца Черниговская - ст-ца Рязанская');
insert into _vedom(id, m, n) values(245,'Белореченский район','с.Школьное - с.Архиповское');
insert into _vedom(id, m, n) values(246,'Белореченский район','ст-ца Пшехская - х.Кубанский');
insert into _vedom(id, m, n) values(247,'Белореченский район','ст-ца Пшехская - п.Дружный');
insert into _vedom(id, m, n) values(248,'Белореченский район','п.Южный - х.Ивановский');
insert into _vedom(id, m, n) values(249,'Белореченский район','г.Белореченск-х.Грушевый');
insert into _vedom(id, m, n) values(250,'Белореченский район','п.Мирный - ст-ца Бжедуховская - х.Беляевский');
insert into _vedom(id, m, n) values(251,'Белореченский район','г.Белореченск - п.Родники');
insert into _vedom(id, m, n) values(252,'Белореченский район','г.Белореченск – ст-ца Ханская');
insert into _vedom(id, m, n) values(253,'Белореченский район','г.Белореченск – п. Нижневеденеевский');
insert into _vedom(id, m, n) values(254,'Белореченский район','п. Мирный - ст. Бжедуховская - Беляевский');
insert into _vedom(id, m, n) values(255,'Белореченский район','п. Мирный - ст. Бжедуховская - Беляевский');
insert into _vedom(id, m, n) values(256,'Белореченский район','г.Белореченск – ст-ца Ханская');
insert into _vedom(id, m, n) values(257,'Брюховецкий район','ст-ца Новоджерелиевская-ст-ца Брюховецкая-ст-ца Батуринская');
insert into _vedom(id, m, n) values(258,'Выселковский район','п.Бейсуг - ст-ца Крупская - п. Первомайский');
insert into _vedom(id, m, n) values(259,'Выселковский район','ст-ца Журавская - г. Тихорецк');
insert into _vedom(id, m, n) values(260,'город Горячий Ключ','г.Горячий Ключ-г.Хадыженск');
insert into _vedom(id, m, n) values(261,'Гулькевичский район','г. Гулькевичи - с. Новоукраинское - х. Шевченко');
insert into _vedom(id, m, n) values(262,'Гулькевичский район','х. Чаплыгин - с. Пушкинское - с. Соколовское');
insert into _vedom(id, m, n) values(263,'Динской район','ст-ца Динская - ст-ца Старомышастовская');
insert into _vedom(id, m, n) values(264,'Динской район','ст-ца Динская - ст-ца Старомышастовская');
insert into _vedom(id, m, n) values(265,'Динской район','г.Краснодар - г.Ейск');
insert into _vedom(id, m, n) values(266,'Динской район','ст-ца Нововеличсковская - с.Долиновское');
insert into _vedom(id, m, n) values(267,'Динской район','ст-ца Нововеличсковская - с.Долиновское');
insert into _vedom(id, m, n) values(268,'Динской район','подъезд к х. Восточный');
insert into _vedom(id, m, n) values(269,'Динской район','ст-ца Динская - п.Агроном');
insert into _vedom(id, m, n) values(270,'Динской район','ст-ца Нововеличсковская - с.Долиновское');
insert into _vedom(id, m, n) values(271,'Динской район','ст-ца Динская - ст-ца Васюринская');
insert into _vedom(id, m, n) values(272,'Ейский район','Приазовка-Воронцовка-Должанская');
insert into _vedom(id, m, n) values(273,'Ейский район','Подъезд к х. Степной');
insert into _vedom(id, m, n) values(274,'Кавказский район','г.Кропоткин-ст.Темижбекская');
insert into _vedom(id, m, n) values(275,'Кавказский район','Подъезд к х.Черномуровский');
insert into _vedom(id, m, n) values(276,'Калининский район','подъезд к с. Гришковское');
insert into _vedom(id, m, n) values(277,'Калининский район','г.Тимашевск - ст-ца Полтавская');
insert into _vedom(id, m, n) values(278,'Каневской район','Западный обход  ст-цы Каневская');
insert into _vedom(id, m, n) values(279,'Каневской район','ст-ца Стародеревянковская - ст-ца Новодеревянковская');
insert into _vedom(id, m, n) values(280,'Каневской район','ст-ца Каневская - ст-ца Березанская');
insert into _vedom(id, m, n) values(281,'Каневской район','г. Ейск - ст. Ясенская - ст. Копанская - ст. Новоминская');
insert into _vedom(id, m, n) values(282,'Кореновский район','ст-ца Платнировская- ст-ца Сергиевкая - ст-ца Дядьковская');
insert into _vedom(id, m, n) values(283,'Кореновский район','ст-ца Платнировская- ст-ца Сергиевкая - ст-ца Дядьковская');
insert into _vedom(id, m, n) values(284,'Кореновский район','г. Кореновск - ст-ца Платнировская');
insert into _vedom(id, m, n) values(285,'Кореновский район','Подъезд к с. Братковское');
insert into _vedom(id, m, n) values(286,'Кореновский район','г. Кореновск - х. Казаче-Малеваный - ст-ца Журавская');
insert into _vedom(id, m, n) values(287,'Красноармейский район','х.Трудобеликовский-ст.Полтавская');
insert into _vedom(id, m, n) values(288,'Красноармейский район','г.Тимашевск - ст-ца Полтавская');
insert into _vedom(id, m, n) values(289,'Красноармейский район','г.Тимашевск - ст-ца Полтавская');
insert into _vedom(id, m, n) values(290,'Красноармейский район','Подъезд к п.Элитный');
insert into _vedom(id, m, n) values(291,'Красноармейский район','п.Полтавский-п.Красный Лес');
insert into _vedom(id, m, n) values(292,'Красноармейский','ст. Старонижестеблиевская - ст Ивановская');
insert into _vedom(id, m, n) values(293,'Красноармейский','ст-ца Полтавская - ст-ца Новониколаевская - х.Пригибский');
insert into _vedom(id, m, n) values(294,'Крыловской район','ст-ца Кущевская-ст-ца Кугоейская-х.Сиротино');
insert into _vedom(id, m, n) values(295,'Крымский район','х. Новотроицкий  - х. Евсеевский - ст-ца Троицкая');
insert into _vedom(id, m, n) values(296,'Крымский район','г. Славянск-на-Кубани - г. Крымск');
insert into _vedom(id, m, n) values(297,'Крымский район','г. Крымск - с. Джигинка');
insert into _vedom(id, m, n) values(298,'Крымский район','с. Киевское - х. Даманка');
insert into _vedom(id, m, n) values(299,'Крымский район','с. Киевское - х. Даманка');
insert into _vedom(id, m, n) values(300,'Крымский район','Андреева Гора - ст-ца Варениковская - г.Анапа');
insert into _vedom(id, m, n) values(301,'Крымский район','с. Экономическое - ст-ца Нижнебаканская');
insert into _vedom(id, m, n) values(302,'Курганинский район','ст-ца Родниковская - ст-ца Новоалексеевская');
insert into _vedom(id, m, n) values(303,'Курганинский район','ст-ца Родниковская - ст-ца Новоалексеевская');
insert into _vedom(id, m, n) values(304,'Курганинский район','х.Кочергин-п.Степной');
insert into _vedom(id, m, n) values(305,'Курганинский район','подъезд к х.Светлая Заря');
insert into _vedom(id, m, n) values(306,'Курганинский район','ст-ца Михайлоская-п.Красный');
insert into _vedom(id, m, n) values(307,'Курганинский район','п.Октябрьский-п.Восточный');
insert into _vedom(id, m, n) values(308,'Кущевский район','с.Красное- х.Средние Чубурки');
insert into _vedom(id, m, n) values(309,'Кущевский район','с.Красное- х.Средние Чубурки');
insert into _vedom(id, m, n) values(310,'Кущевский район','Подъезд к ст-це Кущевская');
insert into _vedom(id, m, n) values(311,'Лабинский район','г.Усть-Лабинск-г.Лабинск-ст-ца Упорная');
insert into _vedom(id, m, n) values(312,'Лабинский район','ст-ца Зассовская-ст-ца Ахметовская');
insert into _vedom(id, m, n) values(313,'Лабинский район','ст-ца Зассовская-ст-ца Ахметовская');
insert into _vedom(id, m, n) values(314,'Лабинский район','ст-ца Отрадная ст-ца Спокойная-с.Гофицкое');
insert into _vedom(id, m, n) values(315,'Лабинский район','ст-ца Вознесенская-х.Первая Синюха');
insert into _vedom(id, m, n) values(316,'Лабинский район','ст-ца Вознесенская-х.Первая Синюха');
insert into _vedom(id, m, n) values(317,'Лабинский район','ст-ца Вознесенская-х.Первая Синюха');
insert into _vedom(id, m, n) values(318,'Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная');
insert into _vedom(id, m, n) values(319,'Ленинградский район','Ст-ца Староминская-ст-ца Ленинградская-ст-ца Павловская');
insert into _vedom(id, m, n) values(320,'Ленинградский район','Ст-ца Челбасская-ст-ца Крыловская-ст-ца Ленинградская');
insert into _vedom(id, m, n) values(321,'Ленинградский район','Подъезд к х. Куликовский');
insert into _vedom(id, m, n) values(322,'Ленинградский район','Подъезд к х. Коржи');
insert into _vedom(id, m, n) values(323,'Мостовской район','г Лабинск- пгт Мостовской- Граница КЧР');
insert into _vedom(id, m, n) values(324,'Мостовской район','пгт Мостовской - ст-ца Хамкетинская');
insert into _vedom(id, m, n) values(325,'Мостовской район','ст-ца Ярославская-    с Унароково');
insert into _vedom(id, m, n) values(326,'Мостовской район','г.Лабинск - пгт.Мостовской - граница Карачаево-Черкесской Республики');
insert into _vedom(id, m, n) values(327,'Мостовской район','г.Лабинск - пгт.Мостовской - граница Карачаево-Черкесской Республики');
insert into _vedom(id, m, n) values(328,'Мостовской район','г.Лабинск - пгт.Мостовской - граница Карачаево-Черкесской Республики');
insert into _vedom(id, m, n) values(329,'Мостовской район','пгт. Мостовской - ст. Баговская - п. Узловой');
insert into _vedom(id, m, n) values(330,'Мостовской район','пгт. Мостовской - ст. Баговская - п. Узловой');
insert into _vedom(id, m, n) values(331,'Мостовской район','пгт. Мостовской - ст. Баговская - п. Узловой');
insert into _vedom(id, m, n) values(332,'Мостовской район','пгт. Мостовской - ст. Баговская - п. Узловой');
insert into _vedom(id, m, n) values(333,'Мостовской район','ст-ца Ярославская – ст-ца Махошевская');
insert into _vedom(id, m, n) values(334,'Мостовской район','ст-ца Ярославская – ст-ца Махошевская');
insert into _vedom(id, m, n) values(335,'Мостовской район','ст-ца Ярославская – ст-ца Махошевская');
insert into _vedom(id, m, n) values(336,'Новокубанский район','г. Армавир- ст-ца Николаевская');
insert into _vedom(id, m, n) values(337,'Новокубанский район','х. Ляпино - с.Камышеваха');
insert into _vedom(id, m, n) values(338,'Новопокровский район','г.Тихорецк - с.Белая Глина - граница Рост. обл.');
insert into _vedom(id, m, n) values(339,'Новопокровский район','ст-ца Кавказская - ст-ца Новопокровская');
insert into _vedom(id, m, n) values(340,'Новопокровский район','п.Кубанский - ст-ца Калниболотская  - п.Первомайский');
insert into _vedom(id, m, n) values(341,'Новопокровский район','п.Кубанский - ст-ца Калниболотская  - п.Первомайский');
insert into _vedom(id, m, n) values(342,'Новопокровский район','п.Заря - ст-ца Новоивановская - ст-ца Плоская');
insert into _vedom(id, m, n) values(343,'Новопокровский район','п.Малокубанский - п.Северный');
insert into _vedom(id, m, n) values(344,'Новопокровский район','ст-ца Новопокровская - ст-ца Плоская');
insert into _vedom(id, m, n) values(345,'город Новороссийск','с. Юровка ст. Раевская г. Новороссийск');
insert into _vedom(id, m, n) values(346,'город Новороссийск','Подъезд к ж.-д. ст. Гайдук');
insert into _vedom(id, m, n) values(347,'город Новороссийск','Подъезд к с. Абрау-Дюрсо');
insert into _vedom(id, m, n) values(348,'Отрадненский район','х.Чайкин - с.Гусаровское - х.Трактовый');
insert into _vedom(id, m, n) values(349,'Отрадненский район','х.Чайкин - с.Гусаровское - х.Трактовый');
insert into _vedom(id, m, n) values(350,'Отрадненский район','Подъезд к с.Благодарное');
insert into _vedom(id, m, n) values(351,'Отрадненский район','п.Урупский - п.Южный');
insert into _vedom(id, m, n) values(352,'Отрадненский район','ст-ца Удобная - х.Зеленчук Мостовой');
insert into _vedom(id, m, n) values(353,'Отрадненский район','ст-ца Отрадная -  ст-ца Удобная - х.Ильич');
insert into _vedom(id, m, n) values(354,'Отрадненский район','Подъезд к ст-це Малотенгинская');
insert into _vedom(id, m, n) values(355,'Павловский район','ст.Старолеушковская-х.Средний Челбас');
insert into _vedom(id, m, n) values(356,'Приморско-Ахтарский район','Подъезд к х.Новонекрасовский');
insert into _vedom(id, m, n) values(357,'Приморско-Ахтарский район','ст-ца Каневская-ст-ца Бриньковская-п.Приморский');
insert into _vedom(id, m, n) values(358,'Приморско-Ахтарский район','ст-ца Каневская-ст-ца Бриньковская-п.Приморский');
insert into _vedom(id, m, n) values(359,'Приморско-Ахтарский район','г.Приморско-Ахтарск - ст-ца Бородинская');
insert into _vedom(id, m, n) values(360,'Приморско-Ахтарский район','ст-ца Ольгинская-ст-ца Степная');
insert into _vedom(id, m, n) values(361,'Приморско-Ахтарский район','г.Приморско-Ахтарск-х.Садки');
insert into _vedom(id, m, n) values(362,'Приморско-Ахтарский район','г. Тимашевск - г. Приморско-Ахтарск');
insert into _vedom(id, m, n) values(363,'Славянский район','ст-ца Петровская - ст-ца Черноерковская - х.Слободка');
insert into _vedom(id, m, n) values(364,'Славянский район','ст-ца Петровская - ст-ца Черноерковская - х.Слободка');
insert into _vedom(id, m, n) values(365,'Славянский район','г.Славянск-на-Кубани - х.Прикубанский');
insert into _vedom(id, m, n) values(366,'Славянский район','г. Славянск-на-Кубани - ст-ца Петровская - п. Целинный - с. Ачуево ');
insert into _vedom(id, m, n) values(367,'Сочи','Мацеста-Абазинка');
insert into _vedom(id, m, n) values(368,'Сочи','Весёлое-Нижняя Шиловка');
insert into _vedom(id, m, n) values(369,'Сочи','ж.д. ст.Аше - а.Лыготх');
insert into _vedom(id, m, n) values(370,'Староминский район','подъезд к х. Желтые Копани');
insert into _vedom(id, m, n) values(371,'Староминский район','ст-ца Староминская - ст-ца Ленинградская - ст-ца Павловская');
insert into _vedom(id, m, n) values(372,'Староминский район','ст-ца Канеловская-п.Орлово-Кубанский   ');
insert into _vedom(id, m, n) values(373,'Староминский район','ст. Староминская -ст. Ленинградская ');
insert into _vedom(id, m, n) values(374,'Тбилисский район','ст-ца Тбилисская - г. Кропоткин');
insert into _vedom(id, m, n) values(375,'Тбилисский район','ст-ца Тбилисская - ст-ца Воздвиженская');
insert into _vedom(id, m, n) values(376,'Тбилисский район','п. Октябрьский - п. Мирный');
insert into _vedom(id, m, n) values(377,'Тбилисский район','Подъезд к ст-це Ловлинская');
insert into _vedom(id, m, n) values(378,'Тбилисский район','Подъезд к х. Советский');
insert into _vedom(id, m, n) values(379,'Тбилисский район','г.Краснодар - г.Кропоткин - граница Ставропольского края');
insert into _vedom(id, m, n) values(380,'Темрюкский район','п.Пересыпь - п.Соленый');
insert into _vedom(id, m, n) values(381,'Темрюкский район','ст-ца Запорожская - п.Гаркуша');
insert into _vedom(id, m, n) values(382,'Тимашевский район','ст.Новокорсунская-х.Незаймановский');
insert into _vedom(id, m, n) values(383,'Тихорецкий район','ст-ца Журавская - г.Тихорецк');
insert into _vedom(id, m, n) values(384,'Тихорецкий район','ст-ца Архангельская - ст-ца Нововладимирская');
insert into _vedom(id, m, n) values(385,'Тихорецкий район','Подъезд к хутору Латыши');
insert into _vedom(id, m, n) values(386,'Туапсинский район','г.Майкоп-г.Туапсе');
insert into _vedom(id, m, n) values(387,'Туапсинский район','с.Шаумян - х.Терзиян');
insert into _vedom(id, m, n) values(388,'Успенский район','с.Коноково-а.Урупский -с. Трехсельское -с. Пантелеймоновское');
insert into _vedom(id, m, n) values(389,'Успенский район','с.Коноково-а.Урупский -с. Трехсельское -с. Пантелеймоновское');
insert into _vedom(id, m, n) values(390,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная');
insert into _vedom(id, m, n) values(391,'Усть-Лабинский район','х.Железный - х.Свободный');
insert into _vedom(id, m, n) values(392,'Усть-Лабинский район','ст-ца Некрасовская - х.Братский');
insert into _vedom(id, m, n) values(393,'Усть-Лабинский район','ст-ца Ладожская - ст-ца Алексее-Тенгинская');
insert into _vedom(id, m, n) values(394,'Усть-Лабинский район','ст-ца Ладожская - ст-ца Алексее-Тенгинская');
insert into _vedom(id, m, n) values(395,'Усть-Лабинский район','х.Неелинский - х.Семеновка');
insert into _vedom(id, m, n) values(396,'Усть-Лабинский район','п.Двубратский - ст-ца Восточная');
insert into _vedom(id, m, n) values(397,'Усть-Лабинский район','г.Краснодар - г.Кропоткин - граница Ставропольского края');
insert into _vedom(id, m, n) values(398,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная ');
insert into _vedom(id, m, n) values(399,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная ');
insert into _vedom(id, m, n) values(400,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная ');
insert into _vedom(id, m, n) values(401,'Усть-Лабинский район','г.Усть-Лабинск - г.Лабинск - ст-ца Упорная ');




update _vedom m
   inner join amstrad_roadinfo._regions r on LOCATE(replace(replace(m.m, ' ', ''), '.', ''), r.name) > 0
set m.munobr_id = r.id
where m.munobr_id is null;  


SELECT distinct m, munobr_id FROM amstrad_routes._vedom where munobr_id is null order by m;

SELECT distinct m, munobr_id FROM amstrad_routes._vedom order by munobr_id;

select id, name from _regions order by name;

-- вручную проставлю районы
select * from _vedom where munobr_id is null order by m;

update _vedom m set m.object_id = null;

-- проставлю дороги
update _vedom m
   inner join amstrad_routes.objects r on 
                                          replace(replace(replace(replace(replace(replace(replace(replace(r.name, 'ст-ца', ''), 'ст', ''), 'х', ''), 'с', ''), ' ', ''), '.', ''), '-', ''), '–', '') = 
                                          replace(replace(replace(replace(replace(replace(replace(replace(m.n, 'ст-ца', ''), 'ст', ''), 'х', ''), 'с', ''), ' ', ''), '.', ''), '-', ''), '–', '')
                       and r.munobr_id = m.munobr_id
set m.object_id = r.id
where m.object_id is null;  

-- вручную проставлю недостающие дороги
select * from _vedom m where object_id is null order by m;
select * from amstrad_routes.objects r where munobr_id = 247;

-- проверка на наличие одной дороги в разных районах
select g.object_id
from (select distinct munobr_id, object_id from _vedom) as g
group by g.munobr_id, g.object_id
having count(g.object_id) > 1 



select * from _vedom where object_id is null;


select distinct m.m, m.n, rr.name, r.name
from _vedom m
inner join amstrad_routes.objects r on r.id = m.object_id
inner join amstrad_roadinfo._regions rr on rr.id = r.munobr_id
order by rr.name, r.name

select id, object_id, munobr_id  from _vedom order by id;





